import tensorflow as tf
import os
os.environ['TF_CPP_MIN_LOG_LEVEL']='2'

def mymigration():
    """
    自实现一个线性回归预测
    """
    # 1、准备数据，这里我们通过一个公式来模拟数据，如果是真实案例，我们可以读取外部数据。
    x = tf.random_normal([100,1], mean=1.75, stddev=0.5, name="x")
    # 矩阵相乘必须是二维的
    y_true = tf.matmul(x, [[0.7]]) + 0.8

    # 2、建立线性回归模型,1个权重、1个偏置， y = w * x + b
    # 随机给一个权重和偏置，让它去计算损失，也就相当于梯度下降的起点
    # 在这里，我们的weight和bias是需要去优化的，它是变化的，必须使用tf.Variable去定义
    # 在训练过程中，我们可以通过设置trainable=False来限制某个变量不跟随梯度下降进行优化，默认是True
    weight = tf.Variable(tf.random_normal([1,1], mean=0.0, stddev=1.0, name="w"))
    bias = tf.Variable(0.0, name="b")
    y_predict = tf.matmul(x, weight) + bias

    # 3、建立损失函数，均方误差，tf.square求方差，reduce_mean()求平均值
    loss = tf.reduce_mean(tf.square(y_true- y_predict))

    # 4、梯度下降优化损失，learning_rate=0~1, 2, 3, ...
    train_op = tf.train.GradientDescentOptimizer(0.1).minimize(loss)

    init_op = tf.global_variables_initializer()

    with tf.Session() as sess:
        sess.run(init_op)

        # 建立事件文件
        filewritter = tf.summary.FileWriter('logs/', graph=sess.graph)

        # 运行优化200次，也就是run op 200次
        print("随机最先初始化的权重和偏置：权重为:%f, 偏置为:%f" % (weight.eval(), bias.eval()))
        for i in range(200):
            sess.run(train_op)
            print("第%d次优化的权重和偏置：权重为:%f, 偏置为:%f" % (i, weight.eval(), bias.eval()))

    return None

if __name__ == "__main__":
    mymigration()


"""
因为没有数据，我们通过公式`y_true = tf.matmul(x, [[0.7]]) + 0.8`来随机样本数据。实际中，我们可以通过读取外部数据，训练并构建模型。

通过200次的训练，我们最后得到的权重为0.715，偏置为0.77，训练的模型还是比较贴合样本数据的，我们可以直接和我们模拟数据的公式进行比较。
如果我们是导入外部数据的话，我们是不知道训练的模型好坏的，我们需要去不断的优化提高模型预测的正确率。
"""

"""
运行结果如下：
随机最先初始化的权重和偏置：权重为:0.247929, 偏置为:0.000000
第0次优化的权重和偏置：权重为:0.802768, 偏置为:0.313890
第1次优化的权重和偏置：权重为:0.903743, 偏置为:0.375552
第2次优化的权重和偏置：权重为:0.920219, 偏置为:0.390434
第3次优化的权重和偏置：权重为:0.920310, 偏置为:0.396307
第4次优化的权重和偏置：权重为:0.912193, 偏置为:0.399372
第5次优化的权重和偏置：权重为:0.915568, 偏置为:0.407380
第6次优化的权重和偏置：权重为:0.909979, 偏置为:0.409388
第7次优化的权重和偏置：权重为:0.909166, 偏置为:0.414006
第8次优化的权重和偏置：权重为:0.909433, 偏置为:0.421018
第9次优化的权重和偏置：权重为:0.902479, 偏置为:0.421775
第10次优化的权重和偏置：权重为:0.900499, 偏置为:0.427563
第11次优化的权重和偏置：权重为:0.893884, 偏置为:0.428584
第12次优化的权重和偏置：权重为:0.896377, 偏置为:0.434979
第13次优化的权重和偏置：权重为:0.893088, 偏置为:0.437073
第14次优化的权重和偏置：权重为:0.892075, 偏置为:0.441436
第15次优化的权重和偏置：权重为:0.889462, 偏置为:0.445687
第16次优化的权重和偏置：权重为:0.891163, 偏置为:0.453173
第17次优化的权重和偏置：权重为:0.885800, 偏置为:0.456553
第18次优化的权重和偏置：权重为:0.883765, 偏置为:0.460807
第19次优化的权重和偏置：权重为:0.887575, 偏置为:0.468666
第20次优化的权重和偏置：权重为:0.884104, 偏置为:0.472289
第21次优化的权重和偏置：权重为:0.875391, 偏置为:0.472825
第22次优化的权重和偏置：权重为:0.874542, 偏置为:0.477118
第23次优化的权重和偏置：权重为:0.873272, 偏置为:0.480546
第24次优化的权重和偏置：权重为:0.871323, 偏置为:0.482999
第25次优化的权重和偏置：权重为:0.871154, 偏置为:0.487275
第26次优化的权重和偏置：权重为:0.864833, 偏置为:0.487922
第27次优化的权重和偏置：权重为:0.863226, 偏置为:0.491976
第28次优化的权重和偏置：权重为:0.865079, 偏置为:0.496915
第29次优化的权重和偏置：权重为:0.860126, 偏置为:0.498729
第30次优化的权重和偏置：权重为:0.864159, 偏置为:0.505790
第31次优化的权重和偏置：权重为:0.852714, 偏置为:0.503454
第32次优化的权重和偏置：权重为:0.857213, 偏置为:0.510454
第33次优化的权重和偏置：权重为:0.851977, 偏置为:0.511486
第34次优化的权重和偏置：权重为:0.852598, 偏置为:0.516214
第35次优化的权重和偏置：权重为:0.850632, 偏置为:0.519629
第36次优化的权重和偏置：权重为:0.849909, 偏置为:0.523477
第37次优化的权重和偏置：权重为:0.852832, 偏置为:0.531090
第38次优化的权重和偏置：权重为:0.846617, 偏置为:0.532888
第39次优化的权重和偏置：权重为:0.843384, 偏置为:0.535327
第40次优化的权重和偏置：权重为:0.841694, 偏置为:0.539057
第41次优化的权重和偏置：权重为:0.834704, 偏置为:0.540347
第42次优化的权重和偏置：权重为:0.831851, 偏置为:0.542456
第43次优化的权重和偏置：权重为:0.835644, 偏置为:0.548846
第44次优化的权重和偏置：权重为:0.834001, 偏置为:0.551958
第45次优化的权重和偏置：权重为:0.831008, 偏置为:0.554798
第46次优化的权重和偏置：权重为:0.828597, 偏置为:0.556797
第47次优化的权重和偏置：权重为:0.824902, 偏置为:0.558216
第48次优化的权重和偏置：权重为:0.827838, 偏置为:0.563847
第49次优化的权重和偏置：权重为:0.829146, 偏置为:0.567886
第50次优化的权重和偏置：权重为:0.829207, 偏置为:0.572080
第51次优化的权重和偏置：权重为:0.826516, 偏置为:0.574593
第52次优化的权重和偏置：权重为:0.820186, 偏置为:0.573974
第53次优化的权重和偏置：权重为:0.821667, 偏置为:0.578438
第54次优化的权重和偏置：权重为:0.818463, 偏置为:0.580208
第55次优化的权重和偏置：权重为:0.815809, 偏置为:0.582147
第56次优化的权重和偏置：权重为:0.815825, 偏置为:0.585133
第57次优化的权重和偏置：权重为:0.815130, 偏置为:0.587823
第58次优化的权重和偏置：权重为:0.818092, 偏置为:0.593479
第59次优化的权重和偏置：权重为:0.806061, 偏置为:0.590317
第60次优化的权重和偏置：权重为:0.805763, 偏置为:0.592832
第61次优化的权重和偏置：权重为:0.807055, 偏置为:0.596703
第62次优化的权重和偏置：权重为:0.809037, 偏置为:0.600293
第63次优化的权重和偏置：权重为:0.806617, 偏置为:0.601685
第64次优化的权重和偏置：权重为:0.804495, 偏置为:0.603355
第65次优化的权重和偏置：权重为:0.803339, 偏置为:0.605761
第66次优化的权重和偏置：权重为:0.802434, 偏置为:0.607631
第67次优化的权重和偏置：权重为:0.801230, 偏置为:0.609634
第68次优化的权重和偏置：权重为:0.800268, 偏置为:0.612227
第69次优化的权重和偏置：权重为:0.797644, 偏置为:0.614921
第70次优化的权重和偏置：权重为:0.798626, 偏置为:0.617450
第71次优化的权重和偏置：权重为:0.797672, 偏置为:0.619641
第72次优化的权重和偏置：权重为:0.793552, 偏置为:0.620466
第73次优化的权重和偏置：权重为:0.793642, 偏置为:0.623383
第74次优化的权重和偏置：权重为:0.796602, 偏置为:0.627626
第75次优化的权重和偏置：权重为:0.792348, 偏置为:0.628259
第76次优化的权重和偏置：权重为:0.792301, 偏置为:0.630543
第77次优化的权重和偏置：权重为:0.793148, 偏置为:0.633191
第78次优化的权重和偏置：权重为:0.788890, 偏置为:0.633438
第79次优化的权重和偏置：权重为:0.788115, 偏置为:0.635686
第80次优化的权重和偏置：权重为:0.790901, 偏置为:0.640215
第81次优化的权重和偏置：权重为:0.789904, 偏置为:0.642251
第82次优化的权重和偏置：权重为:0.785972, 偏置为:0.642264
第83次优化的权重和偏置：权重为:0.786020, 偏置为:0.644344
第84次优化的权重和偏置：权重为:0.783176, 偏置为:0.645257
第85次优化的权重和偏置：权重为:0.782645, 偏置为:0.647552
第86次优化的权重和偏置：权重为:0.782223, 偏置为:0.649520
第87次优化的权重和偏置：权重为:0.779292, 偏置为:0.650023
第88次优化的权重和偏置：权重为:0.778217, 偏置为:0.651669
第89次优化的权重和偏置：权重为:0.776580, 偏置为:0.653032
第90次优化的权重和偏置：权重为:0.776831, 偏置为:0.655515
第91次优化的权重和偏置：权重为:0.776085, 偏置为:0.657166
第92次优化的权重和偏置：权重为:0.772868, 偏置为:0.658413
第93次优化的权重和偏置：权重为:0.774556, 偏置为:0.661811
第94次优化的权重和偏置：权重为:0.771722, 偏置为:0.662505
第95次优化的权重和偏置：权重为:0.772273, 偏置为:0.664960
第96次优化的权重和偏置：权重为:0.774495, 偏置为:0.668269
第97次优化的权重和偏置：权重为:0.771502, 偏置为:0.668567
第98次优化的权重和偏置：权重为:0.770414, 偏置为:0.669390
第99次优化的权重和偏置：权重为:0.770813, 偏置为:0.672022
第100次优化的权重和偏置：权重为:0.769018, 偏置为:0.673421
第101次优化的权重和偏置：权重为:0.769560, 偏置为:0.676035
第102次优化的权重和偏置：权重为:0.766150, 偏置为:0.676423
第103次优化的权重和偏置：权重为:0.766491, 偏置为:0.678962
第104次优化的权重和偏置：权重为:0.763955, 偏置为:0.679392
第105次优化的权重和偏置：权重为:0.765568, 偏置为:0.682770
第106次优化的权重和偏置：权重为:0.763924, 偏置为:0.683422
第107次优化的权重和偏置：权重为:0.762886, 偏置为:0.684526
第108次优化的权重和偏置：权重为:0.762336, 偏置为:0.686277
第109次优化的权重和偏置：权重为:0.759638, 偏置为:0.686436
第110次优化的权重和偏置：权重为:0.760620, 偏置为:0.688692
第111次优化的权重和偏置：权重为:0.759044, 偏置为:0.689629
第112次优化的权重和偏置：权重为:0.759697, 偏置为:0.691701
第113次优化的权重和偏置：权重为:0.758783, 偏置为:0.693073
第114次优化的权重和偏置：权重为:0.757957, 偏置为:0.694467
第115次优化的权重和偏置：权重为:0.757355, 偏置为:0.695350
第116次优化的权重和偏置：权重为:0.756364, 偏置为:0.696374
第117次优化的权重和偏置：权重为:0.753375, 偏置为:0.696402
第118次优化的权重和偏置：权重为:0.753784, 偏置为:0.698284
第119次优化的权重和偏置：权重为:0.753824, 偏置为:0.699645
第120次优化的权重和偏置：权重为:0.755119, 偏置为:0.701991
第121次优化的权重和偏置：权重为:0.755510, 偏置为:0.703658
第122次优化的权重和偏置：权重为:0.752512, 偏置为:0.703510
第123次优化的权重和偏置：权重为:0.750964, 偏置为:0.704261
第124次优化的权重和偏置：权重为:0.751557, 偏置为:0.705942
第125次优化的权重和偏置：权重为:0.750771, 偏置为:0.706945
第126次优化的权重和偏置：权重为:0.749423, 偏置为:0.707688
第127次优化的权重和偏置：权重为:0.748676, 偏置为:0.708377
第128次优化的权重和偏置：权重为:0.749106, 偏置为:0.710064
第129次优化的权重和偏置：权重为:0.748047, 偏置为:0.710775
第130次优化的权重和偏置：权重为:0.746625, 偏置为:0.711262
第131次优化的权重和偏置：权重为:0.746570, 偏置为:0.712357
第132次优化的权重和偏置：权重为:0.746900, 偏置为:0.713929
第133次优化的权重和偏置：权重为:0.746243, 偏置为:0.714777
第134次优化的权重和偏置：权重为:0.744722, 偏置为:0.715695
第135次优化的权重和偏置：权重为:0.744841, 偏置为:0.716678
第136次优化的权重和偏置：权重为:0.744585, 偏置为:0.717726
第137次优化的权重和偏置：权重为:0.743473, 偏置为:0.718393
第138次优化的权重和偏置：权重为:0.742476, 偏置为:0.719161
第139次优化的权重和偏置：权重为:0.742914, 偏置为:0.720546
第140次优化的权重和偏置：权重为:0.742012, 偏置为:0.721481
第141次优化的权重和偏置：权重为:0.741106, 偏置为:0.722174
第142次优化的权重和偏置：权重为:0.741854, 偏置为:0.723634
第143次优化的权重和偏置：权重为:0.741048, 偏置为:0.724418
第144次优化的权重和偏置：权重为:0.739844, 偏置为:0.724658
第145次优化的权重和偏置：权重为:0.740526, 偏置为:0.726146
第146次优化的权重和偏置：权重为:0.739267, 偏置为:0.726567
第147次优化的权重和偏置：权重为:0.739132, 偏置为:0.727329
第148次优化的权重和偏置：权重为:0.737443, 偏置为:0.727349
第149次优化的权重和偏置：权重为:0.737512, 偏置为:0.728853
第150次优化的权重和偏置：权重为:0.738291, 偏置为:0.730517
第151次优化的权重和偏置：权重为:0.739291, 偏置为:0.732291
第152次优化的权重和偏置：权重为:0.736354, 偏置为:0.731796
第153次优化的权重和偏置：权重为:0.736188, 偏置为:0.732659
第154次优化的权重和偏置：权重为:0.735970, 偏置为:0.733470
第155次优化的权重和偏置：权重为:0.735313, 偏置为:0.734166
第156次优化的权重和偏置：权重为:0.735772, 偏置为:0.735537
第157次优化的权重和偏置：权重为:0.734808, 偏置为:0.735841
第158次优化的权重和偏置：权重为:0.733182, 偏置为:0.736120
第159次优化的权重和偏置：权重为:0.732769, 偏置为:0.736985
第160次优化的权重和偏置：权重为:0.733831, 偏置为:0.738589
第161次优化的权重和偏置：权重为:0.732727, 偏置为:0.738958
第162次优化的权重和偏置：权重为:0.732443, 偏置为:0.739523
第163次优化的权重和偏置：权重为:0.732108, 偏置为:0.740316
第164次优化的权重和偏置：权重为:0.731454, 偏置为:0.741024
第165次优化的权重和偏置：权重为:0.731973, 偏置为:0.742251
第166次优化的权重和偏置：权重为:0.731848, 偏置为:0.742878
第167次优化的权重和偏置：权重为:0.729604, 偏置为:0.742546
第168次优化的权重和偏置：权重为:0.729270, 偏置为:0.743245
第169次优化的权重和偏置：权重为:0.729493, 偏置为:0.744170
第170次优化的权重和偏置：权重为:0.729673, 偏置为:0.744999
第171次优化的权重和偏置：权重为:0.728946, 偏置为:0.745340
第172次优化的权重和偏置：权重为:0.728903, 偏置为:0.746043
第173次优化的权重和偏置：权重为:0.728289, 偏置为:0.746873
第174次优化的权重和偏置：权重为:0.728599, 偏置为:0.747829
第175次优化的权重和偏置：权重为:0.727218, 偏置为:0.747786
第176次优化的权重和偏置：权重为:0.726553, 偏置为:0.748103
第177次优化的权重和偏置：权重为:0.727592, 偏置为:0.749488
第178次优化的权重和偏置：权重为:0.727222, 偏置为:0.750081
第179次优化的权重和偏置：权重为:0.726987, 偏置为:0.750757
第180次优化的权重和偏置：权重为:0.726882, 偏置为:0.751424
第181次优化的权重和偏置：权重为:0.725671, 偏置为:0.751580
第182次优化的权重和偏置：权重为:0.725755, 偏置为:0.752375
第183次优化的权重和偏置：权重为:0.725056, 偏置为:0.752616
第184次优化的权重和偏置：权重为:0.725006, 偏置为:0.753293
第185次优化的权重和偏置：权重为:0.725936, 偏置为:0.754545
第186次优化的权重和偏置：权重为:0.724047, 偏置为:0.754449
第187次优化的权重和偏置：权重为:0.723919, 偏置为:0.755118
第188次优化的权重和偏置：权重为:0.722969, 偏置为:0.755217
第189次优化的权重和偏置：权重为:0.723760, 偏置为:0.756409
第190次优化的权重和偏置：权重为:0.723799, 偏置为:0.757134
第191次优化的权重和偏置：权重为:0.722938, 偏置为:0.757377
第192次优化的权重和偏置：权重为:0.722488, 偏置为:0.757987
第193次优化的权重和偏置：权重为:0.722825, 偏置为:0.758750
第194次优化的权重和偏置：权重为:0.722126, 偏置为:0.758971
第195次优化的权重和偏置：权重为:0.721175, 偏置为:0.759006
第196次优化的权重和偏置：权重为:0.721771, 偏置为:0.760031
第197次优化的权重和偏置：权重为:0.721491, 偏置为:0.760511
第198次优化的权重和偏置：权重为:0.720917, 偏置为:0.760769
第199次优化的权重和偏置：权重为:0.720809, 偏置为:0.761378
"""
