# -*- coding: utf-8 -*-
import tensorflow as tf
from tensorflow.examples.tutorials.mnist import input_data
import os
os.environ["KMP_DUPLICATE_LIB_OK"]="TRUE"
os.environ['TF_CPP_MIN_LOG_LEVEL']='2'

FLAGS = tf.app.flags.FLAGS
tf.app.flags.DEFINE_string("data_dir", "/Users/zhusheng/WorkSpace/Dataset/7-Mnist/Mnist/", "mnist数据集")
# 默认是进行训练
tf.app.flags.DEFINE_integer("is_train", 1, "指定程序是预测还是训练")

base_dir = "/Users/zhusheng/WorkSpace/MachineLearning"
events_file_dir = base_dir + "/tmp/summary/test/"
model_dir = base_dir + "/tmp/ckpt/fc_model"

"""
全连接层，有多少个特征就有多少个输出
"""

def full_connected():
    # 获取真实的数据
    mnist = input_data.read_data_sets(FLAGS.data_dir, one_hot=True)

    # 1、建立数据的占位符 x [None, 784]    y_true [None, 10]
    with tf.variable_scope("data"):
        x = tf.placeholder(tf.float32, [None, 784])
        y_true = tf.placeholder(tf.int32, [None, 10])

    # 2、建立一个全连接层的神经网络 w [784, 10]   b [10]
    with tf.variable_scope("fc_model"):
        # 随机初始化权重和偏置
        weight = tf.Variable(tf.random_normal([784, 10], mean=0.0, stddev=1.0), name="w")
        bias = tf.Variable(tf.constant(0.0, shape=[10]))
        # 预测None个样本的输出结果matrix [None, 784]* [784, 10] + [10] = [None, 10]
        y_predict = tf.matmul(x, weight) + bias

    # 3、求出所有样本的损失，然后求平均值
    with tf.variable_scope("soft_cross"):
        # 计算交叉熵损失，并求平均值
        loss = tf.reduce_mean(tf.nn.softmax_cross_entropy_with_logits(labels=y_true, logits=y_predict))

    # 4、梯度下降求出损失
    with tf.variable_scope("optimizer"):
      	# 使用梯度下降优化损失，求损失的最小值
        train_op = tf.train.GradientDescentOptimizer(0.1).minimize(loss)

    # 5、计算准确率
    with tf.variable_scope("acc"):
        # 真实值与预测值的对比，返回的是true or false
        equal_list = tf.equal(tf.argmax(y_true, 1), tf.argmax(y_predict, 1))
        print("equal_list:", equal_list)
        # equal_list  None个样本   [1, 0, 1, 0, 1, 1,..........]
        accuracy = tf.reduce_mean(tf.cast(equal_list, tf.float32))
        print("accuracy:", accuracy)

    # 收集变量 单个数字值收集
    tf.summary.scalar("losses", loss)
    tf.summary.scalar("acc", accuracy)
    # 高纬度变量收集
    tf.summary.histogram("weightes", weight)
    tf.summary.histogram("biases", bias)

    # 定义一个初始化变量的op
    init_op = tf.global_variables_initializer()

    # 定义一个合并变量de op
    merged = tf.summary.merge_all()

    # 创建一个saver，用于进行模型保存和加载
    saver = tf.train.Saver()

    # 开启会话去训练
    with tf.Session() as sess:
        # 初始化变量
        sess.run(init_op)

        # 建立events文件，然后写入
        filewriter = tf.summary.FileWriter(events_file_dir, graph=sess.graph)

        # 训练
        if FLAGS.is_train == 1:
            # 迭代步数去训练，更新参数预测
            for i in range(2000):
                # 取出真实存在的特征值和目标值
                mnist_x, mnist_y = mnist.train.next_batch(50)

                # 运行train_op训练
                sess.run(train_op, feed_dict={x: mnist_x, y_true: mnist_y})

                # 写入每步训练的值
                summary = sess.run(merged, feed_dict={x: mnist_x, y_true: mnist_y})
                filewriter.add_summary(summary, i)

                print("训练第%d步,准确率为:%f" % (i, sess.run(accuracy, feed_dict={x: mnist_x, y_true: mnist_y})))

            # 训练完成后，保存模型。如果训练步数比较多，可以在训练过程中保存模型，默认报错最新的5个。
            saver.save(sess, model_dir)

        # 预测
        else:
            # 加载模型
            saver.restore(sess, model_dir)
						
            # 预测100次
            for i in range(100):
              
                # 每次取一张图片进行预测
                x_test, y_test = mnist.test.next_batch(1)
								
                # 这里直接运行y_predict op即可进行预测，因为到这里，我们的权重和偏置是优化后的
                print("第%d张图片，手写数字图片目标是:%d, 预测结果是:%d" % (
                    i,
                    tf.argmax(y_test, 1).eval(),
                    tf.argmax(sess.run(y_predict, feed_dict={x: x_test, y_true: y_test}), 1).eval()
                ))
    return None


if __name__ == '__main__':
    full_connected()

"""
模型训练
1、执行下面的指令开始训练
python mnist.py

2、查看tensorboard
tensorboard --logdir="tmp/summary/test"

模型预测
1、执行指令
python mnist.py --is_train="0"


模型训练运行结果：
训练第0步,准确率为:0.120000
训练第1步,准确率为:0.120000
训练第2步,准确率为:0.140000
训练第3步,准确率为:0.160000
训练第4步,准确率为:0.100000
训练第5步,准确率为:0.120000
训练第6步,准确率为:0.160000
训练第7步,准确率为:0.040000
训练第8步,准确率为:0.140000
训练第9步,准确率为:0.180000
训练第10步,准确率为:0.080000
训练第11步,准确率为:0.160000
训练第12步,准确率为:0.160000
训练第13步,准确率为:0.120000
训练第14步,准确率为:0.080000
训练第15步,准确率为:0.140000
训练第16步,准确率为:0.100000
训练第17步,准确率为:0.120000
训练第18步,准确率为:0.180000
训练第19步,准确率为:0.180000
训练第20步,准确率为:0.200000
训练第21步,准确率为:0.220000
训练第22步,准确率为:0.160000
训练第23步,准确率为:0.220000
训练第24步,准确率为:0.120000
训练第25步,准确率为:0.200000
训练第26步,准确率为:0.160000
训练第27步,准确率为:0.140000
训练第28步,准确率为:0.220000
训练第29步,准确率为:0.280000
训练第30步,准确率为:0.220000
训练第31步,准确率为:0.200000
训练第32步,准确率为:0.180000
训练第33步,准确率为:0.240000
训练第34步,准确率为:0.280000
训练第35步,准确率为:0.300000
训练第36步,准确率为:0.220000
训练第37步,准确率为:0.240000
训练第38步,准确率为:0.140000
训练第39步,准确率为:0.220000
训练第40步,准确率为:0.180000
训练第41步,准确率为:0.260000
训练第42步,准确率为:0.260000
训练第43步,准确率为:0.260000
训练第44步,准确率为:0.300000
训练第45步,准确率为:0.240000
训练第46步,准确率为:0.160000
训练第47步,准确率为:0.280000
训练第48步,准确率为:0.260000
训练第49步,准确率为:0.240000
训练第50步,准确率为:0.220000
训练第51步,准确率为:0.240000
训练第52步,准确率为:0.340000
训练第53步,准确率为:0.320000
训练第54步,准确率为:0.200000
训练第55步,准确率为:0.400000
训练第56步,准确率为:0.280000
训练第57步,准确率为:0.260000
训练第58步,准确率为:0.320000
训练第59步,准确率为:0.420000
训练第60步,准确率为:0.280000
训练第61步,准确率为:0.380000
训练第62步,准确率为:0.260000
训练第63步,准确率为:0.320000
训练第64步,准确率为:0.400000
训练第65步,准确率为:0.300000
训练第66步,准确率为:0.220000
训练第67步,准确率为:0.340000
训练第68步,准确率为:0.460000
训练第69步,准确率为:0.280000
训练第70步,准确率为:0.300000
训练第71步,准确率为:0.320000
训练第72步,准确率为:0.240000
训练第73步,准确率为:0.460000
训练第74步,准确率为:0.500000
训练第75步,准确率为:0.380000
训练第76步,准确率为:0.380000
训练第77步,准确率为:0.300000
训练第78步,准确率为:0.340000
训练第79步,准确率为:0.480000
训练第80步,准确率为:0.300000
训练第81步,准确率为:0.420000
训练第82步,准确率为:0.380000
训练第83步,准确率为:0.380000
训练第84步,准确率为:0.400000
训练第85步,准确率为:0.440000
训练第86步,准确率为:0.540000
训练第87步,准确率为:0.460000
训练第88步,准确率为:0.440000
训练第89步,准确率为:0.500000
训练第90步,准确率为:0.440000
训练第91步,准确率为:0.480000
训练第92步,准确率为:0.400000
训练第93步,准确率为:0.480000
训练第94步,准确率为:0.520000
训练第95步,准确率为:0.460000
训练第96步,准确率为:0.440000
训练第97步,准确率为:0.360000
训练第98步,准确率为:0.480000
训练第99步,准确率为:0.460000
训练第100步,准确率为:0.500000
训练第101步,准确率为:0.480000
训练第102步,准确率为:0.360000
训练第103步,准确率为:0.460000
训练第104步,准确率为:0.460000
训练第105步,准确率为:0.520000
训练第106步,准确率为:0.520000
训练第107步,准确率为:0.480000
训练第108步,准确率为:0.340000
训练第109步,准确率为:0.500000
训练第110步,准确率为:0.540000
训练第111步,准确率为:0.500000
训练第112步,准确率为:0.540000
训练第113步,准确率为:0.560000
...
训练第231步,准确率为:0.620000
训练第232步,准确率为:0.700000
训练第233步,准确率为:0.700000
训练第234步,准确率为:0.640000
训练第235步,准确率为:0.500000
训练第236步,准确率为:0.600000
训练第237步,准确率为:0.640000
训练第238步,准确率为:0.620000
训练第239步,准确率为:0.720000
训练第240步,准确率为:0.620000
训练第241步,准确率为:0.700000
训练第242步,准确率为:0.700000
训练第243步,准确率为:0.640000
训练第244步,准确率为:0.600000
训练第245步,准确率为:0.720000
训练第246步,准确率为:0.500000
训练第247步,准确率为:0.620000
训练第248步,准确率为:0.680000
训练第249步,准确率为:0.640000
训练第250步,准确率为:0.600000
训练第251步,准确率为:0.680000
训练第252步,准确率为:0.740000
训练第253步,准确率为:0.700000
训练第254步,准确率为:0.580000
训练第255步,准确率为:0.580000
训练第256步,准确率为:0.660000
训练第257步,准确率为:0.700000
训练第258步,准确率为:0.720000
训练第259步,准确率为:0.740000
训练第260步,准确率为:0.640000
训练第261步,准确率为:0.680000
训练第262步,准确率为:0.640000
训练第263步,准确率为:0.720000
训练第264步,准确率为:0.600000
训练第265步,准确率为:0.600000
训练第266步,准确率为:0.600000
训练第267步,准确率为:0.520000
训练第268步,准确率为:0.680000
训练第269步,准确率为:0.640000
训练第270步,准确率为:0.500000
训练第271步,准确率为:0.660000
训练第272步,准确率为:0.620000
训练第273步,准确率为:0.760000
训练第274步,准确率为:0.660000
训练第275步,准确率为:0.560000
训练第276步,准确率为:0.680000
训练第277步,准确率为:0.740000
训练第278步,准确率为:0.700000
训练第279步,准确率为:0.660000
训练第280步,准确率为:0.620000
训练第281步,准确率为:0.680000
训练第282步,准确率为:0.680000
训练第283步,准确率为:0.580000
训练第284步,准确率为:0.760000
训练第285步,准确率为:0.700000
训练第286步,准确率为:0.560000
训练第287步,准确率为:0.680000
训练第288步,准确率为:0.660000
训练第289步,准确率为:0.660000
训练第290步,准确率为:0.540000
训练第291步,准确率为:0.760000
训练第292步,准确率为:0.660000
训练第293步,准确率为:0.560000
训练第294步,准确率为:0.580000
训练第295步,准确率为:0.680000
训练第296步,准确率为:0.600000
训练第297步,准确率为:0.700000
训练第298步,准确率为:0.760000
训练第299步,准确率为:0.740000
训练第300步,准确率为:0.620000
训练第301步,准确率为:0.780000
训练第302步,准确率为:0.640000
训练第303步,准确率为:0.680000
训练第304步,准确率为:0.740000
训练第305步,准确率为:0.660000
训练第306步,准确率为:0.740000
训练第307步,准确率为:0.680000
训练第308步,准确率为:0.740000
训练第309步,准确率为:0.700000
训练第310步,准确率为:0.640000
训练第311步,准确率为:0.680000
训练第312步,准确率为:0.600000
训练第313步,准确率为:0.680000
训练第314步,准确率为:0.620000
训练第315步,准确率为:0.660000
训练第316步,准确率为:0.640000
训练第317步,准确率为:0.600000
训练第318步,准确率为:0.560000
训练第319步,准确率为:0.700000
训练第320步,准确率为:0.680000
训练第321步,准确率为:0.700000
训练第322步,准确率为:0.620000
训练第323步,准确率为:0.760000
训练第324步,准确率为:0.660000
训练第325步,准确率为:0.720000
训练第326步,准确率为:0.640000
训练第327步,准确率为:0.680000
训练第328步,准确率为:0.700000
训练第329步,准确率为:0.520000
训练第330步,准确率为:0.820000
训练第331步,准确率为:0.660000
训练第332步,准确率为:0.700000
训练第333步,准确率为:0.780000
训练第334步,准确率为:0.760000
训练第335步,准确率为:0.640000
训练第336步,准确率为:0.800000
训练第337步,准确率为:0.700000
训练第338步,准确率为:0.680000
训练第339步,准确率为:0.520000
训练第340步,准确率为:0.620000
训练第341步,准确率为:0.620000
训练第342步,准确率为:0.720000
训练第343步,准确率为:0.580000
训练第344步,准确率为:0.700000
训练第345步,准确率为:0.640000
训练第346步,准确率为:0.720000
训练第347步,准确率为:0.640000
训练第348步,准确率为:0.760000
训练第349步,准确率为:0.640000
训练第350步,准确率为:0.860000
训练第351步,准确率为:0.640000
训练第352步,准确率为:0.700000
训练第353步,准确率为:0.660000
训练第354步,准确率为:0.720000
训练第355步,准确率为:0.720000
训练第356步,准确率为:0.680000
训练第357步,准确率为:0.820000
训练第358步,准确率为:0.680000
训练第359步,准确率为:0.700000
训练第360步,准确率为:0.680000
训练第361步,准确率为:0.560000
训练第362步,准确率为:0.760000
训练第363步,准确率为:0.700000
训练第364步,准确率为:0.700000
训练第365步,准确率为:0.660000
训练第366步,准确率为:0.720000
训练第367步,准确率为:0.780000
训练第368步,准确率为:0.600000
训练第369步,准确率为:0.680000
训练第370步,准确率为:0.720000
训练第371步,准确率为:0.680000
训练第372步,准确率为:0.680000
训练第373步,准确率为:0.760000
训练第374步,准确率为:0.740000
训练第375步,准确率为:0.620000
训练第376步,准确率为:0.840000
训练第377步,准确率为:0.780000
训练第378步,准确率为:0.640000
训练第379步,准确率为:0.740000
训练第380步,准确率为:0.660000
训练第381步,准确率为:0.700000
训练第382步,准确率为:0.740000
训练第383步,准确率为:0.780000
训练第384步,准确率为:0.720000
训练第385步,准确率为:0.820000
训练第386步,准确率为:0.800000
训练第387步,准确率为:0.780000
训练第388步,准确率为:0.760000
训练第389步,准确率为:0.760000
训练第390步,准确率为:0.700000
训练第391步,准确率为:0.740000
训练第392步,准确率为:0.740000
训练第393步,准确率为:0.680000
训练第394步,准确率为:0.620000
训练第395步,准确率为:0.700000
训练第396步,准确率为:0.720000
训练第397步,准确率为:0.680000
训练第398步,准确率为:0.640000
训练第399步,准确率为:0.800000
训练第400步,准确率为:0.760000
训练第401步,准确率为:0.720000
训练第402步,准确率为:0.840000
训练第403步,准确率为:0.760000
训练第404步,准确率为:0.680000
训练第405步,准确率为:0.700000
训练第406步,准确率为:0.720000
训练第407步,准确率为:0.720000
训练第408步,准确率为:0.840000
训练第409步,准确率为:0.740000
训练第410步,准确率为:0.740000
训练第411步,准确率为:0.600000
训练第412步,准确率为:0.740000
训练第413步,准确率为:0.860000
训练第414步,准确率为:0.780000
训练第415步,准确率为:0.720000
训练第416步,准确率为:0.760000
训练第417步,准确率为:0.760000
训练第418步,准确率为:0.820000
训练第419步,准确率为:0.740000
训练第420步,准确率为:0.760000
训练第421步,准确率为:0.760000
训练第422步,准确率为:0.680000
训练第423步,准确率为:0.700000
训练第424步,准确率为:0.680000
训练第425步,准确率为:0.700000
训练第426步,准确率为:0.640000
训练第427步,准确率为:0.700000
训练第428步,准确率为:0.760000
训练第429步,准确率为:0.860000
训练第430步,准确率为:0.760000
训练第431步,准确率为:0.760000
训练第432步,准确率为:0.780000
训练第433步,准确率为:0.800000
训练第434步,准确率为:0.720000
训练第435步,准确率为:0.800000
训练第436步,准确率为:0.740000
训练第437步,准确率为:0.820000
训练第438步,准确率为:0.740000
训练第439步,准确率为:0.820000
训练第440步,准确率为:0.660000
训练第441步,准确率为:0.720000
训练第442步,准确率为:0.700000
训练第443步,准确率为:0.800000
训练第444步,准确率为:0.640000
训练第445步,准确率为:0.760000
训练第446步,准确率为:0.700000
训练第447步,准确率为:0.720000
训练第448步,准确率为:0.660000
训练第449步,准确率为:0.700000
训练第450步,准确率为:0.780000
训练第451步,准确率为:0.660000
训练第452步,准确率为:0.740000
训练第453步,准确率为:0.760000
训练第454步,准确率为:0.720000
训练第455步,准确率为:0.660000
训练第456步,准确率为:0.860000
训练第457步,准确率为:0.780000
训练第458步,准确率为:0.700000
训练第459步,准确率为:0.680000
训练第460步,准确率为:0.720000
训练第461步,准确率为:0.800000
训练第462步,准确率为:0.740000
训练第463步,准确率为:0.740000
训练第464步,准确率为:0.760000
训练第465步,准确率为:0.660000
训练第466步,准确率为:0.780000
训练第467步,准确率为:0.660000
训练第468步,准确率为:0.720000
训练第469步,准确率为:0.680000
训练第470步,准确率为:0.840000
训练第471步,准确率为:0.660000
训练第472步,准确率为:0.700000
训练第473步,准确率为:0.680000
训练第474步,准确率为:0.740000
训练第475步,准确率为:0.600000
训练第476步,准确率为:0.680000
训练第477步,准确率为:0.780000
训练第478步,准确率为:0.740000
训练第479步,准确率为:0.760000
训练第480步,准确率为:0.700000
训练第481步,准确率为:0.720000
训练第482步,准确率为:0.720000
训练第483步,准确率为:0.580000
训练第484步,准确率为:0.700000
训练第485步,准确率为:0.680000
训练第486步,准确率为:0.780000
训练第487步,准确率为:0.700000
训练第488步,准确率为:0.640000
训练第489步,准确率为:0.720000
训练第490步,准确率为:0.780000
训练第491步,准确率为:0.780000
训练第492步,准确率为:0.600000
训练第493步,准确率为:0.680000
训练第494步,准确率为:0.740000
训练第495步,准确率为:0.560000
训练第496步,准确率为:0.680000
训练第497步,准确率为:0.760000
训练第498步,准确率为:0.800000
训练第499步,准确率为:0.700000
训练第500步,准确率为:0.780000
训练第501步,准确率为:0.760000
训练第502步,准确率为:0.780000
训练第503步,准确率为:0.660000
训练第504步,准确率为:0.840000
训练第505步,准确率为:0.700000
训练第506步,准确率为:0.720000
训练第507步,准确率为:0.760000
训练第508步,准确率为:0.820000
训练第509步,准确率为:0.680000
训练第510步,准确率为:0.680000
训练第511步,准确率为:0.780000
训练第512步,准确率为:0.820000
训练第513步,准确率为:0.700000
训练第514步,准确率为:0.700000
训练第515步,准确率为:0.740000
训练第516步,准确率为:0.780000
训练第517步,准确率为:0.740000
训练第518步,准确率为:0.840000
训练第519步,准确率为:0.580000
训练第520步,准确率为:0.700000
训练第521步,准确率为:0.680000
训练第522步,准确率为:0.600000
训练第523步,准确率为:0.640000
训练第524步,准确率为:0.840000
训练第525步,准确率为:0.760000
训练第526步,准确率为:0.720000
训练第527步,准确率为:0.720000
训练第528步,准确率为:0.700000
训练第529步,准确率为:0.700000
训练第530步,准确率为:0.700000
训练第531步,准确率为:0.720000
训练第532步,准确率为:0.700000
训练第533步,准确率为:0.740000
训练第534步,准确率为:0.780000
训练第535步,准确率为:0.760000
训练第536步,准确率为:0.720000
训练第537步,准确率为:0.720000
训练第538步,准确率为:0.800000
训练第539步,准确率为:0.740000
训练第540步,准确率为:0.900000
训练第541步,准确率为:0.660000
训练第542步,准确率为:0.780000
训练第543步,准确率为:0.780000
训练第544步,准确率为:0.740000
训练第545步,准确率为:0.820000
训练第546步,准确率为:0.820000
训练第547步,准确率为:0.720000
训练第548步,准确率为:0.540000
训练第549步,准确率为:0.720000
训练第550步,准确率为:0.700000
...
训练第1136步,准确率为:0.840000
训练第1137步,准确率为:0.900000
训练第1138步,准确率为:0.920000
训练第1139步,准确率为:0.820000
训练第1140步,准确率为:0.740000
训练第1141步,准确率为:0.780000
训练第1142步,准确率为:0.820000
训练第1143步,准确率为:0.860000
训练第1144步,准确率为:0.840000
训练第1145步,准确率为:0.880000
训练第1146步,准确率为:0.880000
训练第1147步,准确率为:0.900000
训练第1148步,准确率为:0.840000
训练第1149步,准确率为:0.920000
训练第1150步,准确率为:0.860000
训练第1151步,准确率为:0.900000
训练第1152步,准确率为:0.800000
训练第1153步,准确率为:0.720000
训练第1154步,准确率为:0.900000
训练第1155步,准确率为:0.800000
训练第1156步,准确率为:0.820000
训练第1157步,准确率为:0.800000
训练第1158步,准确率为:0.800000
训练第1159步,准确率为:0.780000
训练第1160步,准确率为:0.800000
训练第1161步,准确率为:0.820000
训练第1162步,准确率为:0.740000
训练第1163步,准确率为:0.880000
训练第1164步,准确率为:0.840000
训练第1165步,准确率为:0.900000
训练第1166步,准确率为:0.780000
训练第1167步,准确率为:0.780000
训练第1168步,准确率为:0.740000
训练第1169步,准确率为:0.860000
训练第1170步,准确率为:0.840000
训练第1171步,准确率为:0.880000
训练第1172步,准确率为:0.860000
训练第1173步,准确率为:0.760000
训练第1174步,准确率为:0.740000
训练第1175步,准确率为:0.700000
训练第1176步,准确率为:0.720000
训练第1177步,准确率为:0.700000
训练第1178步,准确率为:0.860000
训练第1179步,准确率为:0.760000
训练第1180步,准确率为:0.840000
训练第1987步,准确率为:0.780000
训练第1988步,准确率为:0.840000
训练第1989步,准确率为:0.880000
训练第1990步,准确率为:0.840000
训练第1991步,准确率为:0.740000
训练第1992步,准确率为:0.860000
训练第1993步,准确率为:0.860000
训练第1994步,准确率为:0.940000
训练第1995步,准确率为:0.880000
训练第1996步,准确率为:0.840000
训练第1997步,准确率为:0.880000
训练第1998步,准确率为:0.820000
训练第1999步,准确率为:0.840000


模型预测运行结果：

第0张图片，手写数字图片目标是:8, 预测结果是:8
第1张图片，手写数字图片目标是:8, 预测结果是:8
第2张图片，手写数字图片目标是:7, 预测结果是:7
第3张图片，手写数字图片目标是:5, 预测结果是:5
第4张图片，手写数字图片目标是:0, 预测结果是:0
第5张图片，手写数字图片目标是:6, 预测结果是:6
第6张图片，手写数字图片目标是:7, 预测结果是:7
第7张图片，手写数字图片目标是:7, 预测结果是:7
第8张图片，手写数字图片目标是:4, 预测结果是:4
第9张图片，手写数字图片目标是:6, 预测结果是:6
第10张图片，手写数字图片目标是:5, 预测结果是:5
第11张图片，手写数字图片目标是:5, 预测结果是:5
第12张图片，手写数字图片目标是:1, 预测结果是:1
第13张图片，手写数字图片目标是:4, 预测结果是:4
第14张图片，手写数字图片目标是:2, 预测结果是:2
第15张图片，手写数字图片目标是:5, 预测结果是:3
第16张图片，手写数字图片目标是:2, 预测结果是:2
第17张图片，手写数字图片目标是:3, 预测结果是:3
第18张图片，手写数字图片目标是:9, 预测结果是:9
第19张图片，手写数字图片目标是:9, 预测结果是:7
第20张图片，手写数字图片目标是:0, 预测结果是:0
第21张图片，手写数字图片目标是:9, 预测结果是:9
第22张图片，手写数字图片目标是:2, 预测结果是:2
第23张图片，手写数字图片目标是:3, 预测结果是:3
第24张图片，手写数字图片目标是:3, 预测结果是:3
第25张图片，手写数字图片目标是:2, 预测结果是:2
第26张图片，手写数字图片目标是:9, 预测结果是:9
第27张图片，手写数字图片目标是:2, 预测结果是:2
第28张图片，手写数字图片目标是:0, 预测结果是:0
第29张图片，手写数字图片目标是:3, 预测结果是:3
第30张图片，手写数字图片目标是:3, 预测结果是:3
第31张图片，手写数字图片目标是:8, 预测结果是:8
第32张图片，手写数字图片目标是:0, 预测结果是:0
第33张图片，手写数字图片目标是:6, 预测结果是:6
第34张图片，手写数字图片目标是:9, 预测结果是:9
第35张图片，手写数字图片目标是:6, 预测结果是:6
第36张图片，手写数字图片目标是:4, 预测结果是:4
第37张图片，手写数字图片目标是:5, 预测结果是:5
第38张图片，手写数字图片目标是:5, 预测结果是:5
第39张图片，手写数字图片目标是:0, 预测结果是:0
第40张图片，手写数字图片目标是:0, 预测结果是:0
第41张图片，手写数字图片目标是:1, 预测结果是:8
第42张图片，手写数字图片目标是:7, 预测结果是:7
第43张图片，手写数字图片目标是:8, 预测结果是:8
第44张图片，手写数字图片目标是:7, 预测结果是:7
第45张图片，手写数字图片目标是:7, 预测结果是:7
第46张图片，手写数字图片目标是:5, 预测结果是:5
第47张图片，手写数字图片目标是:5, 预测结果是:5
第48张图片，手写数字图片目标是:0, 预测结果是:0
第49张图片，手写数字图片目标是:4, 预测结果是:4
第50张图片，手写数字图片目标是:6, 预测结果是:6
第51张图片，手写数字图片目标是:9, 预测结果是:9
第52张图片，手写数字图片目标是:5, 预测结果是:5
第53张图片，手写数字图片目标是:7, 预测结果是:7
第54张图片，手写数字图片目标是:4, 预测结果是:4
第55张图片，手写数字图片目标是:0, 预测结果是:0
第56张图片，手写数字图片目标是:2, 预测结果是:2
第57张图片，手写数字图片目标是:3, 预测结果是:3
第58张图片，手写数字图片目标是:6, 预测结果是:6
第59张图片，手写数字图片目标是:8, 预测结果是:8
第60张图片，手写数字图片目标是:3, 预测结果是:3
第61张图片，手写数字图片目标是:1, 预测结果是:5
第62张图片，手写数字图片目标是:8, 预测结果是:8
第63张图片，手写数字图片目标是:1, 预测结果是:1
第64张图片，手写数字图片目标是:8, 预测结果是:8
第65张图片，手写数字图片目标是:7, 预测结果是:7
第66张图片，手写数字图片目标是:8, 预测结果是:8
第67张图片，手写数字图片目标是:3, 预测结果是:3
第68张图片，手写数字图片目标是:6, 预测结果是:6
第69张图片，手写数字图片目标是:2, 预测结果是:4
第70张图片，手写数字图片目标是:6, 预测结果是:6
第71张图片，手写数字图片目标是:5, 预测结果是:5
第72张图片，手写数字图片目标是:5, 预测结果是:9
第73张图片，手写数字图片目标是:9, 预测结果是:9
第74张图片，手写数字图片目标是:1, 预测结果是:1
第75张图片，手写数字图片目标是:8, 预测结果是:8
第76张图片，手写数字图片目标是:6, 预测结果是:6
第77张图片，手写数字图片目标是:4, 预测结果是:4
第78张图片，手写数字图片目标是:3, 预测结果是:3
第79张图片，手写数字图片目标是:4, 预测结果是:4
第80张图片，手写数字图片目标是:6, 预测结果是:6
第81张图片，手写数字图片目标是:4, 预测结果是:4
第82张图片，手写数字图片目标是:0, 预测结果是:0
第83张图片，手写数字图片目标是:2, 预测结果是:4
第84张图片，手写数字图片目标是:4, 预测结果是:4
第85张图片，手写数字图片目标是:3, 预测结果是:3
第86张图片，手写数字图片目标是:1, 预测结果是:1
第87张图片，手写数字图片目标是:4, 预测结果是:4
第88张图片，手写数字图片目标是:1, 预测结果是:1
第89张图片，手写数字图片目标是:1, 预测结果是:1
第90张图片，手写数字图片目标是:2, 预测结果是:2
第91张图片，手写数字图片目标是:0, 预测结果是:0
第92张图片，手写数字图片目标是:3, 预测结果是:2
第93张图片，手写数字图片目标是:7, 预测结果是:7
第94张图片，手写数字图片目标是:0, 预测结果是:0
第95张图片，手写数字图片目标是:0, 预测结果是:0
第96张图片，手写数字图片目标是:8, 预测结果是:8
第97张图片，手写数字图片目标是:7, 预测结果是:7
第98张图片，手写数字图片目标是:7, 预测结果是:7
第99张图片，手写数字图片目标是:1, 预测结果是:1
"""